{
  "Common Causes": {
    "name": [
      "1.Disorders of coagulation:",
      "a.Haemophilia",
      "b.Christmas Disease",
      "2.Disorders of platelets:",
      "a).Decreased production e.g. Aplastic anaermnia",
      "b).Increased destruction e.g. ldiopathic thrombocytopenic purpura and Hypersplenism.",
      "c).Poor function e.g. Thrombasthenia and chronic renal failure",
      "3:",
      "Disorders of Coagulation and bleeding (Combined) e.g. Von Willebrand’s disease, disseminated intravascular coagulation (DIC)",
      "4:",
      "Disorders due to vascular defects e.g. Senile Purpura, Henoch Schonlein’s purpura, Hereditary Haemorrhagic talengiectasia.",
      ""
    ]
  },
  "History of Present Illness": {
    "name": [
      "purpura, Henoch ,",
      "1.Age at onset:",
      "Childhood (Haemophilia, Christmas disease, acute auto-immune thrombocytopenic purpura, henoch Schonlein’s purpura, Von Willebrand’s disease, rarely aplastic anaemia), adults (Aplastic anaemia, chronic autoimmune thrombocytopenic purpura, Hereditary haemorrhagic talengiectasia, disseminated intravascular coagulation), old age (Senile purpura).",
      "2.Site of bleeding;",
      "Joints, muscles, rarely internal organs, very rarely from mucus membranes (Haemophilia, Christmas disease, anticoagulant therapy), epistaxis, bleeding from gums or other mucus membranes and skin thrombocytopenic purpura, acute Leukaemia, Von Willebrand’s disease, thrombasthenia, Hereditary haemorrhagic talengiectasia), mainly skin (senile purpura, Cushing's syndrome, primary easy bruising), from many sites (Disseminated intravascular coagulation), after injury in all types of bleeding disorders).",
      "3.Type of bleeding after injury:",
      "Sudden, within minutes after injury, usually stopping within 48 hours and nonrecurrent (Thrombocytopenic purpura, Von Willebrand’s disease, disseminated intravascular coagulation), gradual, after minutes to hours of injury even when the wound appears to be healed, recurrent (Haemophilia, anti-coagulant therapy and Christmas disease). ",
      "4.Character of bleeding in the skin:",
      "Pinpoint or pinhead sized spots i.e. petechiae, most marked on dependent parts (Thrombocytopenic purpura) or on the buttockks (Henoch Schonlein’s purpura), bruises (Senile purpura, idiopathic bruising, bruising, Cushing’s syndrome, rarely thrombocytopenic purpura), subcutaneous haematoma formation (Haemophilia, Von Willebrand's disease).",
      "5.Associated symptoms:",
      "a.Sore throat (Aplastic anaemia)",
      "b.Fever (Aplastic anaemia, acute leukaemia, after tissue bleeding in haemophilia and rarely in thrombocytopenic purpura)",
      "c.Lymphadenopathy (Acute or chronic lymphocytic leukaemia).",
      "d.Joint pains, oliguria, haematuria and abdominal pain (Henoch Schonlein’s purpura).",
      "e.Symptoms of anaemia. i.e. pallor, dizziness, easy fatiguibility, breathlessnęss and palpitations can Occur after significant blood loss.",
      ""
    ]
  },
  "Past History": {
    "name": [
      "a).Recurrent episodes of joint pains, swelling sometimes bruising over the joints (Haemophilia)",
      "b).Excessive bleeding after ingestion of Aspirin (Von Willebrand’s disease)",
      "c).Excessive bleeding at the time of circumcision or falling of milk teeth (Haemophilia) or after minor wounds (Haemophilia, thrombocytopenic purpura).",
      "d).Prominent small blood vessels present on the lips and mouth (Hereditary haemorrhagic talengiecasia).",
      "e).Recurrent episodes of epIstaxis or bleeding gums and rarely haematuria, haematemesis And menorrhagia (Von Willebrand’s disease, thrombocytopenia or  thrombasthenia).",
      "f).Abortion, delivery of dead-born foetus, Snake bite or disseminated malignancy (Disseminated intra-vascular coagulation).",
      ""
    ]
  },
  "Faimly History": {
    "name": [
      "a)Similar disease in brothers, maternal cousins and maternal uncles i.e. X-linked recessive inheritance (Haemophilia and Christmas disease).",
      "b)Similar disease in one of the parents and fifty percent of the brothers and sisters i.e. autosomal dominant inheritance (Von- Willebrand’s disease and hereditary haemorrhagic talengiectasia).",
      ""
    ]
  },
  "Personal History": {
    "name": ["Not Enough Data"]
  },
  "Drug History": {
    "name": [
      "Ask about the use of the following drugs prior to bleeding episode:",
      "a.Heparin or oral anti-coagulant drugs ( Bleeding due to toxicity).",
      "b.Chloramphenicol, kushtas,  Thiazide diuretics, phenylbutazone or the drugs used for the treatment of malignant disease (Aplastic anaemia).",
      "c.Aspirin (Von-Willebrand’s disease and Haemophilia).",
      ""
    ]
  },
  "Differntail Diagnosis": {
    "name": [
      "1.Thrombocytopenic purpura:",
      "The disease may be primary and autoimmune or secondary to bone marrow depression due to drugs or malignant infiltration or secondary to hypersplenism. Autoimmune thrombocy-topenic purpura usually manifests in children when the prognosis is good while in adults it has a chronic course and poor prognosis. Patient manifests a history of pinpoint haemorrhagic spots on the skin occasionally with bruising. Bleeding usually occurs from nose or gums and rarely from gastrointestinal or genitourinary tract. In secondary purpura the symptoms of the underlying disease are often prominent.",
      "2.Senile purpura:",
      "The patient is an old person complaining of easy bruisibility of the skin on minor trauma which is often unnoticed by the patient. There is no quantitative or qualitative defect of platelets and the cause is the lack of support of the subcutaneous blood vessels due to atrophy of the fatty tissue.",
      "3.Haemophilia:",
      "The patient is often a male child with history  of recurrent episodes of bleeding into the joints causing their Swelling and painful limitation of movements. These episodes usually follow trauma but may occur spontaneously in severe cases when there may be bruising or haematoma formation under the skin or in the múscles. Bleeding from the mucus membranes is , however, rare. The disease may be brought to the notice of the Paents by abnormal bleeding at the time of circumcision, falling of milk teeth or minor injuries. Injuries usually cause bleeding after delay of few hours with apparent initial haemostasis which Lasts for many days. Headache is a warning symptom of life patients threatening intracerebral haemorrhage. Most of these patients have similarly affected brothers, maternal uncles and maternal cousins. The bleeding tendency can be controlled by transfusion of fresh blood or factor VIII extract.",
      "4.Von Willebrands Disease:- The disease first manifests in childhood with history of recurrent episodes of epistaxis, bleeding from the gums and sometimes with haematemesis, melaena, haematuria or in females menorrhagia. Bleeding after injury is almost immediate and usually lasts for about 48 hours. Bleeding into the joints is rare. A family history of one affected parent and almost 50% of the brothers and sisters affected fromn the same disease may be present.",
      ""
    ]
  }
}
