{
  "Common Causes": {
    "name": [
      "DEFINITION:",
      "Upper abdominal pain or discomfort often but not always related to meals is called dyspepsia. It may or may not be ssociated with ith flatulence, heartburn and nausea or vomiting.",
      " COMMON CAUSES:",
      "1.Non-ulcer or functional dyspepsia ",
      "2.Gastric and duodenal ulcer",
      "3.Irritable bowel syndrome",
      "4.Chronic cholecystitis ",
      "5.Chronic cholecystitis",
      "6.Recurrent appendicitis ",
      "7.Gastric Carcinoma ",
      ""
    ]
  },
  "History of Present Illness": {
    "name": [
      "1.Age:",
      "Young adults (Non-ulcer dyspepsia, duodenal ulcer and hiatus hernia), middle age (Gastric ulcer, chronic cholecystitis and chronic pancreatitis), old age(Gastric carcinoma). ",
      "2.Pain:",
      "Ask about",
      "a).Site:",
      " Epigastrium or left hypochondrium (Gastric Ulcer), right part of epigastrium (Duodenal ulcer), Right iliac fossa (Recurrent Appendicitis), right hypochondrium (Chronic cholecystitis), diffusely over the upper abdomen or the lower abdomen which may spread to the whole abdomen (Non-ulcer dyspepsia or irritable bowel syndrome respectively).",
      "b).Character:",
      "Cutting or burning (Peptic ulcer sometimes non- ulcer Dyspepsia), click (Acute attacks of chronic cholecystitis and sometimes recurrent appendicitis)  (Chronic pancreatitis), fullness or heaviness (Non-ulcer dyspepsia).",
      "c).Radiation:",
      "To right shoulder or the lower angle of the right scapula (Biliary colic in chronic cholecystitis) penetrating through to the back (Penetrating duodenal ulcer), from umblicus to the right iliac fossa (Recurrent appendicitis). ",
      "d).Relationship to food:",
      "Food causing pain (Gastric Ulcer) food relieving pain (Duodenal ulcer), no definite relation to food (non-ulcer dyspepsia)",
      "e.)Timing of pain:",
      "Pain occurring half an hour after meal (Gastric Ulcer), pain one and a half hours after meals (Duodenal ulcer), pain in the early hours of the morning often waking the patient (Duodenal ulcer), constant pain in between the meals although increased by meals (Gastric carcinoma and penetrating peptic ulcer), no definite relationship of timing of pain to meals (Non- ulcer dyspepsia, chronic cholecystitis, chronic pancreatitis and recurrent appendicitis). ",
      "f).Periodicity:",
      "Episodes lasting 7 to 14 days or longer, occurring two to six times a year particularly in spring and autumn (Peptic ulcer), with no definite periodicity (all other conditions). ",
      "3.Aggravating and relieving factors:",
      "Worsened by fatty food (Chronic cholecystitis and chronic pancreatitis), spicy food (Peptic ulcer), running and jolting (Recurrent appendicitis). Relieved by antacids and  vomiting (Duodenal ulcer and sometimes gastric ulcer) or antispasmodic drugs (All conditions). ",
      "4.Associated symptoms:",
      "a):",
      " Flatulence:- belching, bloating, eructations, and flatus (Usually non-ulcer dyspepsia and chronic cholecystitis, Sometimes in chronie pancreatitis, recurrent appendicitis and peptic ulcer). ",
      "b):",
      " Symptoms of depression or anxiety with morning nausea or vomiting and anorexia without any significant weight loss (Non-ulcer or functional dyspepsia). ",
      "c):",
      " Heartburn (Reflux oesophagitis, sometimes peptic ulcer). ",
      "d):",
      " Large, bulky, offensive and greasy stools (Chronic Pancreatitis).",
      "e):",
      "Weight loss (Gastric carcinoma, sometimes in peptic ulcer).",
      "f):",
      " Diarrhoea alternating with constipation and scanty stools containing mucus (Irritable bowel syndrome). ",
      ""
    ]
  },
  "Past History": {
    "name": [
      "Ask about past history of ",
      "1:",
      " Attacks of colicky pain in the right hypochondrium (Biliary colic in Chronic cholecystitis).",
      " 2:",
      "Haematemesis or melaena (Peptic Ulcer) ",
      "3:",
      "Similar symptoms in the past (Peptic Ulcer and Chronic Cholecystitis).",
      ""
    ]
  },
  "Faimly History": {
    "name": [
      "Ask about the history of similar symptoms or death of other family members from a similar disease (Peptic Ulcer or Gastric Carcinoma) "
    ]
  },
  "Personal History": {
    "name": [
      "Unmarried, separated or tense individual (Non -ulcer dyspepsia or irritable colon), alcoholism (Chronic pancreatitis and peptic ulcer). History of the use of steroids or non-steroidal anti-inflammatory drugs (Peptic Ulcer). "
    ]
  },
  "Drug History": {
    "name": [
      " History of the use of steroids or non-steroidal anti-inflammatory drugs (Peptic Ulcer)."
    ]
  },
  "Differntail Diagnosis": {
    "name": [
      "1.Non Ulcer or functional dyspepsia:",
      "The patient is often a tense, unmarried or separated individual who complains of vague upper abdominal discomfort, flatulence or pain. Pain when present is often described with sweeping movement of one or both hands. Pain cannot be relieved by simple measures, is unconvincing or changing from time to time and although it occurs before break-fast, it does not disturb sleep. Belching, burping and morning nausea may be prominent. When vomiting occurs patient cannot eat for several hours afterwards. Symptoms are continuous ocçurring daily over long periods of time. Associated symptoms of anxiety or depression may be present and there may be history of previous psychiatric disturbances. ",
      "2.Peptic ulcer:",
      "The patient may be a young (Duodenal ulcer) or middle-aged individual (Gastric ulcer) complaining of cutting, or burning pain in the epigastrium or left hypochondrium (gastric ulcer) or right hypochondrium (duodenal ulcer) which is brought on (gastric ulcer) or relieved by food (Duodenal Ulcer) although this association may not be present. Patients with duodenal ulcers may wake up early in the morning due to pain. Pain is often relieved by antacids or vomiting and worsened by spicy food, steroids or non-steroidal anti-inflammatory drugs. Associated symptoms may include nausea, vomiting, and retrosternal burning water brash. Haematemesis or melaena may Occur. Symptoms often occur in episodes lasting 7 to 14 days or longer two to six times a year with long remissions. There may be a family history of similar symptoms. Change in the pattern of symptoms with no relief by food, antacids, or continuous symptoms with associated symptoms of anorexia, pallor and weight loss in a patient with a known gastric ulcer is very suspicious of change to gastric carcinoma. ",
      "3.Chronic cholecystitis:",
      "The patient is often but not always a fat, fertile female past her forty complaining of flatulence with or without biliary colic. Biliary colic presents as pain in the right hypochondrium or epigastrium which may radiate to the right shoulder or scapula. Pain is very severe, coming in attacks lasting for minutes to hours and associated with vomiting, shivering and sweating and relieved by strong analgesics only. There may be history of jaundice,, clay colour ed stools and dark urine after Such an attack. These symptoms are often worsened by fatty or fried meals."
    ]
  }
}
