{
  "Common Causes": {
    "name": [
      "1:",
      "Idiopathic epilepsy i.e. not associated with any demonstrable organic brain lesion.",
      "2:",
      "Grand mal epilepsy (Major motor seizures)",
      "3:",
      "Petit mal epilepsy (Minor motor seizures).This type includes",
      "Classical absence attacks",
      "Myoclonic seizures",
      "Akinetic seizures",
      "4:",
      "Symptomatic epilepsy i.e associated with some demonstrable organic brain lesion.",
      "a):",
      "Tonic-clonic (Focal) epilepsy ",
      "b):",
      "Temporal lobe (Psychomotor) epilepsy",
      "c):",
      "Complex partial seizures",
      "d):",
      "Unclassified seizures",
      ""
    ]
  },
  "History of Present Illness": {
    "name": [
      "1.Duration and age at onset:",
      "Long duration with onset during childhood (ldiopathic epilepsy), recent onset of fits at or after the age of 30 (Symptomatic epilepsy due to space occupying lesion of brain e.g. tumour, abscess or haematoma).",
      "2.Frequency of fits:",
      "How often do the fits occur? This information does not help in the diagnosis of the type of epilepsy but helps to judge the severity and the urgency for treatment e.g continuous fits without gaining consciousness is indicative of status epilepticus which is a medical emergency needing urgent treatment. This also helps to monitor the response to treatment.",
      "3.Description of a typical fit:",
      "This information should ideally be obtained from an eyewitness who has seen the fit. This information is so vital for a diagnosis that a descriptive letter or telephone may help in the diagnosis.",
      "Note about:",
      "a):",
      "A cry (which may be absent) followed by a fall to the ground with tongue-bite or another injury, a tonic phase in which the whole body becomes rigid causing cyanosis, a clonic phase in which there is flinging movements of the limbs and loss of bowel or bladder control, finally leaving the patient asleep which lasts for a variable period and the patient waking without any knowledge to what had happened (Grand-mal epilepsy).",
      "b):",
      "Brief absences with loss of contact with the environment (Absence attacks),. Or brief, sudden involuntary muscle contractions (Myoclonic jerks) or sudden, transitory loss of motor tone causing the patient to fall and then to get up almost immediately (Akinetic seizures). All these are variants of Petit-mal epilepsy.",
      "c):",
      "Attacks involving automatic behaviour or activity and/or dreamy states with feelings of familiarity or unfamiliarity and/or symptoms suggestive of auditory, olfactory or gustatory hallucinations with or without lip smacking (Temporal lobe or psychomotor epilepsy).",
      "d):",
      "Tonic or clonic fits limited to one limb or one half of the body and spreading in a peculiar fashion to that side or the whole body. This is usually in attacks lasting few minutes (Jacksonian seizures) or rarely contınue for a long time sometimes lasting for months (Epilepsia partialis continua).",
      "e):",
      "Attacks involving deep sighing respirations witn occasional spasms of the jaw muscles, Occasional irregular movements of the limbs, vacant look during the attacks without any loss of consciousness, injury or tongue-bite in a young tense female (Hysterical fits).",
      "4.Timing of the fits:",
      "Occurring at any time of the day or night alone or in the presence of other people while sitting, standing or lying (Organic fits due to epilepsy), or occurring at a specific time, in the presence of other people and while lying so that no injury occurs (Hysterical fits).",
      "5.Memory for the fits:",
      "No memory for the fit and for a variable period there- after, so that the patient himself is not able to describe a fit (Organic fits due to epilepsy), patient remembering about the fits (Hysterical fits).",
      "6.Duration of each attack:",
      "Few seconds –(Petit mal) to few minutes-(grand mal epilepsy) or few hours to few days (Hysterical fits, rarely status epilepticus). ",
      "7.Precipitating factors:",
      "Anxiety or some emotional outburst (Hysterical fits, rarely organic fits), watching television or seeing flickering lights or moving from a dark to bright place and vice versa (Organic grand mal epileptic fits).",
      "8.Associated symptoms:",
      "a):",
      "Fever (an important cause of fits in children i.e. febrile convulsions).",
      "b):",
      "Headache with progressing paralysis or change in the conscious level or intellectual functions (Symptomatic epilepsy due to a space occupying lesion of the brain).",
      "c):",
      "Transient paralysis following a fit (Todd’s paralysis due to temporal lobe epilepsy).",
      "d):",
      "Symptoms suggestive of anxiety with attacks of hyperventilation (Hysterical fits).",
      "e):",
      "Rash on the face (Sturge Weber syndrome and tuberous sclerosis).",
      ""
    ]
  },
  "Past History": {
    "name": [
      "Ask about a past history of head injury, meningitis or ear discharge."
    ]
  },
  "Faimly History": {
    "name": [
      "Ask about any history of epilepsy in the family and if so also ask about the drugs taken by the affected relative. (Patients of the same family often respond better to the same drug). "
    ]
  },
  "Personal History": {
    "name": [
      " Ask about alcohol or drug addiction (These may precipitate fits). Also ask about the occupation of the patient. (Note that driving as well as working with machinery is dangerous for an epileptic and alternative job may need to be advised). From the relatives ask about any change in intellectual functions (Symptomatic epilepsy). "
    ]
  },
  "Drug History": {
    "name": [
      " Ask about use of chlorpromazine or haloperidol (These drugs can precipitate an attacks of epilepsy)."
    ]
  },
  "Differntail Diagnosis": {
    "name": [
      "1.Grand mal epilepsy:",
      "Usually occurs in young adults, Occurrence after the age of 30 is often due to some secondary cause, In a typical attack patient falls to the ground with or Without a cry and becomes unconscious in the process often injuring himself. The body becomes rigid and cyanosis Occurs (Tonic phase duration 30 seconds) after which jerky movements of the limbs occur (Clonic phase—duration 30 seconds).Tongue-bite, salivation and urinary or Faecal incontinence may occur during this phase. After the fit patient may remain unconscious for a variable time. Upon awakening the patient is often drowsy and confused and may complain of headache and pain in the muscles although he does remember what actually happened to him. The duration of fits is variable lasting for less than a minute to thirty minutes  or even longer. The fits may occur during any time of the day or night. When the the fits occur continuously without any period of consciousness this condition is called status epilepticus and is a medical emergency.",
      "2.Petit mal epilepsy:",
      "This type of epilepsy usually occurs in children. Classical type consists of brief episodes of absences or loss of contact with the surroundings without any loss of muscle tone. In another type of petit muscle epilepsy myoclonic jerks in the form of brief, sudden involuntary muscle contractions Occur while rarely these fits may take the form of akinetic seizures with transient loss of muscle tone sufficient to cause falling from which the child gets up almost immediately. These fits are not followed by a postictal state. As many as fifty or more attacks may occur in a day.",
      "3.Focal epilepsy(Jacksonian's fits):",
      "This type of epilepsy is often due to an organic brain lesion. Continuous focal motor seizures of exceptionally long duration sometimes lasting for months are called Epilepsia partialis continua.",
      "4.Psychomotor(Temporal lobe) epilepsy:",
      "The fits may take the form of absences of variable duration with lip-smacking, dreamy states with feelings of familiarity to an unfamiliar surroundings (Deja vu phenomenon) or vice versa (Jamais vu phenomenon) and forced or compulsive thinking or acts. There may be auditory, visual, olfactory or gustatory hallucinations and/or repetitive automatic behaviour or actions.",
      "5.Hysterical fits:",
      "These types of fits usually occur, in young unmarried females as a manifestation of conversion hysteria. Fits take the form of hyperventilation, clenching of the teeth or nonspecific flinging movements of the limbs without any loss of consciousness. The fits usually occur in the presence of other people and may be preceded by some emotional outburst. There is no injury or loss of sphincter control. Symptoms of associated Anxiety are often present. These fits respond to sedatives or breathing into a paper bag.",
      ""
    ]
  }
}
