{
  "Common Causes": {
    "name": [
      "1:",
      "Tension Headache",
      "2.Headache due to the diseases of adjacent structures:",
      "a:",
      "Eye diseases",
      "b:",
      "Ear diseases",
      "c:",
      "Sinusitis",
      "3:",
      "Headache due to meningeal irritation e.g. Meningitis and subarachnoid haemorrhage",
      "4:",
      "Hypertension ",
      "5:",
      "Migraine and cluster headache",
      "6:",
      "Headache due to raised intracranial pressure ",
      "7:",
      "Giant cell arteritis (Temporal arteritis)",
      ""
    ]
  },
  "History of Present Illness": {
    "name": [
      "1.Age:",
      "Young to middle-aged adults (Tension headache, migraine, cluster headache), old age (Temporal arteritis), all ages (Headache due to sinusitis, eye or ear diseases, meningitis and raised intracranial pressure).",
      "2.Sex:",
      "Usually females (Tension headache, migraine and temporal arteritis), usually males (Cluster headache), either sex (Sinus, eye or ear diseases, meningeal irritation, hypertension and raised intracranial pressure).",
      "3.Duration:",
      "A few days (Meningitis and subarachnoid haemorrhage), a few weeks (Headache due to raised intracranial pressure), a few months to years (Tension headache, migraine and cluster headache). However, duration at the presentation depends upon when the patient decides to see a doctor.",
      "4.Site:",
      "Generalised or bioccipital (Tension headache) On unilateral but on one or the other side in each ttack (Migraine), limited to attacks usually in the periorbital zed initially, later on diffuse the same side of the head in all region (Cluster headache), localized initially, later on (Space-occupying lesions causing raised intracranial pressure) Generalised with predominant occiptal localization (Subarachnoid (Temporal haemorrhage), occipital (Meningitis), temporal (Temporal arteritis).",
      "5.Character:",
      "Band-like, pressing or squeezing (Tension headache), throbbing or pounding (Migraine, sometimes in fever and hypertension), dull (Cluster headache, meningeal irritation, eye and ear diseases), bursting or explosive (Subarachnoid haemorrhage).",
      "6.Severity:",
      "It varies from patient to patient, is subjective and not very helpful in making a diagnosis. However it helps to plan treatment and follow the progress in an individual case",
      "7.Diurnal Rhythm:",
      "Nocturnal, one or more hours after falling to sleep (Cluster headache), early morning (Migraine, hypertension and raised intracranial pressure), increasing in intensity as the sun rises, reaching a peak at noon and then subsiding (Frontal sinusitis), no specific timing (Tension headache, meningeal irritation and diseases of the eye and ears).",
      "8.Prodromal symptoms:",
      "Anoreixa, nausea, scintillating lights, transient hemianopia, hemianaesthesia, hemiparesis or speech disturbances (Migraine).",
      "9.Aggravating factors:",
      "a):",
      "high Bright light, tension, cheese, chocolate, high carbohydrate diet and menstruation (Migraine). ",
      "b):",
      "Fatigue and nervous tension (Tension headache)",
      "c):",
      "Alcohol (Migraine and cluster headache)",
      "d):",
      "Coughing and straining (Headache due to  raised intracranial pressure).",
      "e):",
      "Reading or eye strain (Refractive errors of the eye)",
      "f):",
      "High blood pressure usually above 110 m.m.Hg  diastolic (Hypertension).",
      "g):",
      "Noise and bright light (Meningeal irritation)",
      "h):",
      "No definite aggravating factor (Sinusitis and ear diseases).",
      "10.Relieving factors:",
      "a:",
      "Ergotamine preparations (Migraine and cluster  headache).",
      "b:",
      "Anti-depressants (Usually tension headache, sometimes 8 cluster headache) ",
      "c:",
      "Steroids (Temporal arteritis, headache due to raised  intracranial pressure, sometimes cluster headache).",
      "d:",
      "Anti-hypertensive drugs (Hypertension) ",
      "e:",
      "Any analgesic (To a certain extent all types of headaches).",
      "11.Associated symptoms:",
      "a):",
      "Fever (Usually meningitis or encephalitis, although headache can occur in any fever)",
      "b):",
      "Neck-stiffness (Usually meningitis and subarachnoid haemorrhage, rarely hypertension, refractive errors and space occupying lesions of the posterior cranial fossa).",
      "c):",
      "Painful eyes: with redness (Acute glaucoma and uveitis), without redness (Retrobulbar neuritis).",
      "d):",
      "Post-nasal discharge, (Sinusitis).",
      "e):",
      "Ear discharge, Tinitus or, deafness (Otiti media, sometimes mastoiditis and temporal lobe abscess)",
      "f):",
      "Lacrimation or rhinorrhoea (Cluster headache)",
      "g):",
      "Projectile vomiting, drowsiness, Confusion or Coma (Raised intracranial pressure due to space occupying lesions of the brain or meningeal irritation).",
      "h):",
      "Vomiting and epigastric discomfort during the attack (Migraine). ",
      "i):",
      "Anorexia, insomnia, palpitations and fear of brain  tumour (Tension headache).",
      "j):",
      "Painful palpable temporal arteries, sensitive scalp, sometimes blindness (Temporal arteritis).",
      "12.Course:",
      "a:",
      "Attacks with free intervals of weeks or months, frequency of attacks decreasing with advancing age (Migraine).",
      "b:",
      "Nocturnal attacks continuing for weeks or months, Occasionally also Occurring during day time (Cluster headaches).",
      "c:",
      "Gradual improvement with specific treatment (Meningitis, hypertension and refractive errors).",
      "d:",
      "Gradual worsening with the passage of time unless operated on (Headache due to expanding space-occupying lesions of the brain).",
      "e:",
      "Usually one episode only (Meningitis, encephalitis)",
      ""
    ]
  },
  "Past History": {
    "name": [
      "Ask about a past history of:",
      "a):",
      "Hypertension with irregular treatment",
      "b):",
      "Head injury, although the patient might have considered it trivial (Subdural haematoma)",
      "c):",
      "Stroke with partial or complete haematoma",
      "d):",
      "Ear discharge (Chronic otitis media, mastoiditis, meningitis or temporal lobe abscess)",
      "e):",
      "Use of glasses (Refractive errors)",
      ""
    ]
  },
  "Faimly History": {
    "name": [
      " Enquire about any other relatives having hypertension or hemicranial headache i.e. migraine or the patient having any worries (Tension headache). "
    ]
  },
  "Personal History": {
    "name": ["Not Enough Data"]
  },
  "Drug History": {
    "name": [
      " Previous treatment taken for headache or hypertension or any drugs which could be the cause of headache e.g Nitroglycerine, isosorbide dinitrate or Nnifedipine."
    ]
  },
  "Differntail Diagnosis": {
    "name": [
      "1.Tension Headache:",
      "It is one of the most common headaches. The patient is usually a young to middle aged female complaining of continuous, band-like, squeezing or pressing, generalised or bioccipital headache increasing in intensity as the day progresses and lasting for a few months to years, aggravated by worries, tension or fatigue and relieved by anti-anxiety or antidepressant drugs. Such patients may have phobia of brain tumour. The patient often has domestic or marital problems.",
      "2.Headache due to diseases of the Eye, ear and Sinuses:",
      "The patient may be of any age or sex. Typical location of headache adnd associated symptoms of the diseases of these structures are usually helpful in making the correct diagnosis.",
      "3.Headache due to meningeal irritation:",
      "It affects any age or sex. History is usually of few days with complaints of intense, deep, continuous, bioccipital, dull pain, aggravated by bright light or noise and relieved by the specific treatment. There are associated symptoms of neck stiffness and fever. A single ear is usual. There may be a past history of untreated discharging ear.",
      "4.Headache due to raised intracranial pressure:",
      "This type of headache is usually due to raised pressure resulting from an expanding space-occupying lesion of the brain (Haematoma tumour or abscess) or rarely due to benign intracranial hypertension. It affects any age and both sexes. Headache is dull localized or diffuse, worse in the morning, aggravated by straining, coughing or change in the position of the head and relieved to some extent by steroids and mannitol. It may progress to cause projectile vomiting, confusion, coma or death.",
      "5.Headache due to hypertension:",
      "It affects any age and both sexes. It usually occurs when a diastolic pressure is more than 110 m.m.Hg. and is not so common as is thought. Headache is dull, bioccipital, usually worse in the morning and waking the patient from sleep. Vomiting may be present and often relieves the headache to a certain extent. It is also relieved by proper antihypertensive therapy. Often there is history of irregular antihypertensive treatment. Family history may be positive for hypertension.",
      "6.Migraine:",
      "It occurs in young to middle aged adults, more commonly in females than males, with attacks lasting few hours or one or two days, headache is often unilateral, rarely bilateral, throbbing, worse on waking, preceded by anorexia, nausea, scintillating lights in front of the eyes, hemianopia hemianaesthesia, hemiparesis or speech disturbance with vomiting and epigastric discomfort during the attack. Attacks are aggravated by tension, menstruation, cheese, chocolate, alcohol, carbohydrate rich diet and relieved by sleep and darkness. Attacks decrease in intensity and frequency during pregnancy and with advancing age. There may be a positive family history.Ergotamine preparations may terminate an acute attack as may other analgesics. Propranolol often prevents further attacks.",
      "7.Cluster headache (Migrainous neuralgia):",
      "Usually occurs in adolescent or adult males who have history of intense, nonthrobbing headache, usually unilateral and limited to the same side of the head in all attacks often in the periorbital region. Attacks are nocturnal, one or more hours after falling to sleep. Attacks may occur nightly for several weeks or months, rarely also during the day.Headache is often associated with rhinorrhoea and watering of the eyes. Alcohol may precipitate an attack while ergotamine and antidepressants relieve the symptoms. Steroids may be helpful in certain cases.",
      "8.Temporal arteritis (Giant cell arteritis:",
      "The patient is usually an old person above the age of 60, often a female with history of severe headache, throbbing initially, aching or burning later on. Patient may feel the temporal arteries to have become thickened and tender and the scalp sensitive. The pain is usually unilateral, in the temporal or occipital region, persisting for a few weeks or months and can be associated with blindness, muscle pains and weakness (Polymyalgia rheumatica), fever and weight loss. It responds to steroids.",
      ""
    ]
  }
}
