{
  "Common Causes": {
    "name": [
      "DEFINITION:",
      "Arthritis means pain in the joints with associated symptoms and signs of inflammation while joint pain without associated symptoms and signs of inflammation is called Arthralgia.",
      "CAUSES:",
      "1.Osteoarthritis",
      "2.Rheumatoid arthritis and other collagen diseases",
      "3.Rheumatic fever",
      "4.Septic arthritis",
      "5.Tuberculous arthritis",
      "6.Gouty arthritis",
      "7.Seronegative arthritis i.e. Ankylosing spondylitis,  Psoriatic arthritis, Reiter’s disease, Reactive arthritis, Enteropathic arthritis and Behcet’s disease. ",
      ""
    ]
  },
  "History of Present Illness": {
    "name": [
      "1.Onset:",
      "Sudden (Gouty arthritis, Septic arthritis), gradual (Rheumatic fever, Rheumatoid arthritis or other collagen diseases and tuberculous arthritis), slow (Osteoarthritis and Ankylosing spondylitis).",
      "2.Number of joints involved:",
      "One joint only i.e. monarticular (Tuberculous arthritis, septic arthritis and gouty arthritis), two or more Joints i.e. polyarticular (Rheumatoid arthritis or other collagen diseases, osteoarthritis, Rheumatic fever and Seronegative arthritis).",
      "3.Joints affected:",
      "Proximal interphalangeal and metacarpophalangeal joints followed by other joints (Rheumatoid Arthritis or other collagen diseases), distal Interphalangeal joints followed by other joints (Psoriatic arthritis) Spine, hips and knees (Osteoarthritis and tuberculous arthritis), sacroiliac joints  (Ankylosing spondylitis and other seronegative arthritionts first metatarsophalangeal joints (Gouty arthritis).",
      "4.Pattern of joint involvement:",
      "Small joints (Rheumatoid arthritis and other collagen diseases, Sometimes seronegative arthritis), large joints (Osteoarthritis, rheumatic fever, septic arthritis and tuberculous arthritis).",
      "5.Character of joint involvement:",
      "a).Symmetrical i.e. affecting the same joints to the same extent on both sides of the body (Rheumatoid arthritis other collagen diseases and Ankylosing spondylitis) or asymmetrical Osteoarthritis, Rheumatic fever, gonococcal arthritis and enteropathic arthritis)",
      "b).Migratory i.e. moving from one joint to other joint, the first affected joint becoming normal when the second is involved (Rheumatic fever).",
      "6.Diurnal variations of symptoms:",
      "(a).Worse in the morning i.e. morning stiffness (Rheumatoid arthritis and other collagen diseases, Behcet’s disease).",
      "(b).Worse in the evening (Osteoarthritis) or at night (uberculous arthritis and Gouty arthritis)",
      "7.Associated symptoms:",
      "a.crackling sound in the ioints on walking (Osteoarthritis",
      "b.Fever (Rheumatoid arthritis and other collagen diseases, Rheumatic fever and septic arthritis)",
      "c.Rash:- as scaling eruption on extensor surfaces of limbs (psoriatic arthritis), butterfly rash on the face (S.L.E.), Or painful nodular lesions on the shins i.e. erythema nodosum (Rheumatic fever, Sometimes in enteropathic arthritis and Behcet’s disease).",
      "d.Bloody diarrhoea (Reactive arthritis and enteropathic arthritis).",
      "e.Urethral discharge (Gonococcal arthritis and Reiter’s e) disease).",
      "f.Redness of the eyes (Rheumatoid arthritis, enteropathic arthritis, Reiter’s disease and Behcet’s disease).",
      "g.Muscle cramps at night esp. In children i.e. night starțs (Tuberculous arthritis) ",
      "8.Progress:",
      "a).Attacks off and on lasting for few days with intervals of freedom lasting for weeks, months or years (Gouty arthritis).",
      "b).Remissions and exacerbations ultimately leading to joint deformities (Rheumatoid arthritis and psoriatic arthritis).",
      "c).Arthritis followed by symptoms of heart disease or heart failure months to years later (Rheumatic fever).",
      "d).Slowly progressive course without any remissions (Osteoarthritis and ankylosing spondylitis).",
      "e).One episode with complete recovery after successful treatment (Septic arthritis and tuberculous arthritis).",
      "f).Arthritis, with acute episodes off and on not causing any deformities (Rheumatic fever, S.L.E. and enteropathic arthritis).",
      ""
    ]
  },
  "Past History": {
    "name": [
      "Ask about a previous history of:",
      "a).Scaly rash on extensor surtaces of the limbs (psoriatic arthritis)",
      "b).Sexual contact (Gonococcal arthritis and Reiter’s disease)",
      "c).Diarrhoea (Reactive arthritis and enteropathic arthritis)",
      ""
    ]
  },
  "Faimly History": {
    "name": [
      " Sometimes positive in Rheumatoid arthritis and Ankylosing spondylitis."
    ]
  },
  "Personal History": {
    "name": ["Not Enough Data"]
  },
  "Drug History": {
    "name": ["Not Enough Data"]
  },
  "Differntail Diagnosis": {
    "name": [
      "1.Osteoarthritis:",
      "Often the patient is an obese person who complains of constant dull pain in the weight bearing joints (Knees, spine, hips and ankles) which is worse in the evening. Joints are asymmetrically involved and morning stiffiness is uncommon. On walking there may be audible crackling sound in the joints. With progression of the disease pain and Stiffness increases. Constitutional symptoms are usually absent. Rarely distal interphalangeal joints (Heberden’s nodes) or proximal interphalangeal joints (Bouchard’s nodes) may be involved.",
      "2.Rheumatoid arthritis:",
      "The patient is usually a female with gradual symmetrical involvement of joints causing pain, swelling and stiffness which is often worse in the morning and in winter. The disease is polyarticular with predilection for small joints or the hands although large joints may be affected later. Proximal interphalangeal and metacarpophalangeal joints are usually first invoved but knee joint may be first involved in young patients. Eyes may become red due to scleritis or episcleritis. The course of remissions and exacerbations which may ultimately  deformities of the hands and feet with difficulty in hand grip or walking. Other collagen diseases also cause similar symptoms but usually do not cause any residual deformities and often there are other symptoms of underlving disease e.g. butterfly rash in S.L.E., pain and weakness of the muscles in polymyositis. Fever may or may not be a prominent feature.",
      "3.Rhumatic Fever:",
      "The patient is often a child with history of migratory, asymmetrical polyarthritis involving large joints with fever and sometimes rash and rarely involuntary movements Rheumatic chorea). Usually there is history of sore throat one to four weeks prior to these symptoms. The arthritis subsides without any residual deformities but months or years later patient may develop symptoms of heart disease with or without symptoms of heart failure. (i.e. It licks the joints but bites the heart).",
      "4.Gouty arthritis:",
      "The patient often gets a sudden attack of monarticular arthritis usually involving first metatarsophalangeal joint (Podagra). The involved joint becomes red, swollen and very painful causing difficulty in walking. There may be family history of similar disease. Renal colic and swellings in the ears (Tophi) may be other associated symptoms.",
      "5.Ankylosing spondylitis:",
      "Usually the patient is a young teen- aged rnale who complains of low back pain with stiffness and difficulty in bending, Pain is worse at rest and improves to some extent with activity. Gradually pain and stiffness of the spine increase over the years and with involvement of the chest there is breathlessness. There may be history of painful red eyes due to Iritis. Family history may be positive. Symptoms similar to ankylosing spondylitis may occur in Enteropathic arthritis ( Crohn‘s disease and Ulcerative colitis with associated symptoms bloody diarrhoea),. Psoriatic arthritis (with associated scaly skin rash), and Reiter’s disease (with associated urethritis).",
      ""
    ]
  }
}
